#ifdef __MODULE_16__
/* Задание 2. Сшиватель дробных чисел
 *  Что нужно сделать
 *  Напишите небольшую программу. Из целой и дробной частей числа, которые в отдельности вводит
 *  пользователь, составьте новое число с плавающей точкой (типа double) и выведите это число
 *  обратно в консоль для проверки. Целая часть — это часть числа, которая находится до точки
 *  (запятой), дробная — после.
 *  Рекомендации:
 *  Вам потребуется функция StringToDouble — std::stod. Она принимает на вход строку, содержащую в
 *  себе число. */

#include <iostream>
#include "Module_16.hpp"

void Task_16_2() {
    std::cout << equals << string_tasks[1] << equals;


}
#endif
