#ifdef __MODULE_37__
/* Задание 2. Видеопроигрыватель на QML
 *  Что нужно сделать:
 *  Требуется составить интерфейс простого видеопроигрывателя на языке QML.
 *  Основную верхнюю зону интерфейса составляет сам экран проигрывателя. Снизу расположены средства
 *  управления воспроизведением, а именно: кнопка начала воспроизведения (Play), кнопка паузы
 *  воспроизведения (Pause), кнопка остановки воспроизведения (Stop), перемотка (Rewind), быстрое
 *  воспроизведение (Forward). Далее за ними расположен горизонтальный ползунок текущего места
 *  воспроизведения.
 *  
 *  Советы и рекомендации:
 *  Для отображения элементов управления вы можете использовать Unicode-символы: ▶️,⏸️,⏹,⏪️,⏩️.
 *  Ползунок воспроизведения вы можете реализовать с помощью элемента ProgressBar. */

#include <iostream>
#include "Module_37.hpp"

void Task_37_2(int argc, char **argv) {
    std::cout << equals;
    std::wcout << string_tasks[1];
    std::cout << equals;

    std::wcout << L"Запустить с помощью VS Code почему-то не удается =(\n";
    std::wcout << L"Поэтому я сохранил файлы из проекта Qt Creator.\n";
    std::wcout << L"См. исходные файлы в директории Module_37/Task_37_2/\n";
}

#include <Task_37_2.moc>

#endif
