#ifdef __MODULE_35__
/* Задание 1 (к уроку 2)
 *  Цель задания:
 *  Закрепить работу с нововведениями в базовых конструкциях языка.
 *  
 *  Что нужно сделать:
 *  Вспомните пример с range-based циклом по закрытию файлов:
 *  
 *      for(auto ¤tFile : files)
 *          currentFile.close();
 *  
 *  По аналогии распечатайте числа от 1 до 5, используя auto и initializer_list. */

#include <iostream>
#include "Module_35.hpp"

void Task_35_1() {
    std::cout << equals << string_tasks[0] << equals;


}
#endif
